OpenFOAM-v1812/tutorials/combustion/reactingFoam/RAS/membrane/0.orig/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletSleeve
    {
        type            fixedValue;
        value           uniform $:sleeve.CH4;
    }
    inletPipe
    {
        type            fixedValue;
        value           uniform $:pipe.CH4;
    }
    outletSleeve
    {
        type            inletOutlet;
        inletValue      uniform $:sleeve.CH4;
        value           uniform $:sleeve.CH4;
    }
    outletPipe
    {
        type            inletOutlet;
        inletValue      uniform $:pipe.CH4;
        value           uniform $:pipe.CH4;
    }
    wall
    {
        type            zeroGradient;
    }
    membraneSleeve
    {
        type            semiPermeableBaffleMassFraction;
        samplePatch     membranePipe;
        c               0.1;
        value           uniform $:sleeve.CH4;
    }
    membranePipe
    {
        type            semiPermeableBaffleMassFraction;
        samplePatch     membraneSleeve;
        c               0.1;
        value           uniform $:pipe.CH4;
    }
}


// ************************************************************************* //
